# Задание 6

def int_func(*args):
    text = input('Введите текс -')
    print(text.title())
    return
int_func()
